app/views/courses/_sec_comb.html.erb

SELECT COUNT(*) FROM "sections" WHERE "sections"."section_setting_id" = 7
---
<% unless section.section_setting.sections.count == 1 %>