app/controllers/courses_controller.rb

INSERT INTO "courses" ("course_id", "created_at", "name", "subject", "updated_at") VALUES (?, ?, ?, ?, ?)  [["course_id", 899], ["created_at", Tue, 10 Mar 2015 03:08:52 UTC +00:00], ["name", "history"], ["subject", "history"], ["updated_at", Tue, 10 Mar 2015 03:08:52 UTC +00:00]]
---
  def create
    @course = Course.new(course_params)
    valid = @course.save

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all.sort { |c1, c2| ("#{c1.subject}#{c1.course_id}" <=> "#{c2.subject}#{c2.course_id}") }