app/controllers/dates_controller.rb

  def create
    start_date = (params[:start_date].nil? ? get_sdate(params) : params[:start_date])
    end_date = (params[:end_date].nil? ? get_edate(params) : params[:end_date])

    @date = CourseDate.new(start_date: start_date, end_date: end_date)
    valid = @date.save
---
INSERT INTO "course_dates" ("created_at", "end_date", "start_date", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 09 Mar 2015 05:57:11 UTC +00:00], ["end_date", "3/10/2015"], ["start_date", "3/6/2015"], ["updated_at", Mon, 09 Mar 2015 05:57:11 UTC +00:00]]

  def index
    @dates = CourseDate.all
---
SELECT "course_dates".* FROM "course_dates"

  def edit
    @date = CourseDate.find(params[:id])
---
SELECT "course_dates".* FROM "course_dates" WHERE "course_dates"."id" = ? LIMIT 1  [["id", "4"]]

  def update
    start_date = (params[:start_date].nil? ? get_sdate(params) : params[:start_date])
    end_date = (params[:end_date].nil? ? get_edate(params) : params[:end_date])

    @date = CourseDate.find(params[:id])

    valid = @date.update(start_date: start_date, end_date: end_date)
---
SELECT "course_dates".* FROM "course_dates" WHERE "course_dates"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "course_dates" SET "end_date" = ?, "updated_at" = ? WHERE "course_dates"."id" = 4  [["end_date", "3/15/2015"], ["updated_at", Mon, 09 Mar 2015 16:22:09 UTC +00:00]]