app/controllers/home_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 3 LIMIT 1
---
  def room_pdf

    PdfReport::Pdfreport.create_room_pdf(Section.find(:all))