app/controllers/instructors_controller.rb

INSERT INTO "instructors" ("created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 10 Mar 2015 03:09:55 UTC +00:00], ["first_name", "kartik"], ["last_name", "kartik"], ["updated_at", Tue, 10 Mar 2015 03:09:55 UTC +00:00]]
---
  def create
    @instructor = Instructor.new(instructor_params)
    valid = @instructor.save

SELECT "instructors".* FROM "instructors"
---
  def index
    @instructors = Instructor.all