app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    valid = @room.save
---
INSERT INTO "rooms" ("board_type", "building", "chair_type", "created_at", "desk_type", "room_capacity", "room_num", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "6"]]

  def update
    @room = Room.find(params[:id])
    valid = @room.update(room_params)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "rooms" SET "room_capacity" = ?, "updated_at" = ? WHERE "rooms"."id" = 6  [["room_capacity", 500], ["updated_at", Tue, 17 Mar 2015 09:00:43 UTC +00:00]]