app/controllers/sections_controller.rb

	def new
    @section = Section.new
    @action = :create

    @room_props = Room.all_room_props

    @sets = get_option_list
    @sets[:course] = Course.find(params[:course_id]).to_arr_element
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]

  def cross
    @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]

  def combine
    @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "10"]]

  def create
    print params
    puts "\n\n"

    valid = true
    time = nil
    time_id = nil

    # Get time
    time_valid = !(time = get_time(params)).nil?
    time_id = Homie.new.insert_into(TimeSlot, days: time[:days], start_time: time[:start], end_time: time[:end]) if time_valid

    room_id = params[:room_num].to_i
    room_id = nil if room_id == 0

    inst_id = params[:instructor_list].to_i
    inst_id = nil if inst_id == 0

    date_id = params[:date_list].to_i
    date_id = nil if date_id == 0

    # Now get section setting
    ss_id = Homie.new.insert_into(SectionSetting, time_slot_id: time_id, room_id: room_id, instructor_id: inst_id, course_date_id: date_id)
---
INSERT INTO "time_slots" ("created_at", "days", "end_time", "start_time", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 10 Mar 2015 08:45:39 UTC +00:00], ["days", "TW"], ["end_time", "11:15:00 AM"], ["start_time", "10:05:00 AM"], ["updated_at", Tue, 10 Mar 2015 08:45:39 UTC +00:00]]
INSERT INTO "section_settings" ("course_date_id", "created_at", "instructor_id", "room_id", "time_slot_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["course_date_id", 5], ["created_at", Tue, 10 Mar 2015 08:45:39 UTC +00:00], ["instructor_id", 1], ["room_id", 4], ["time_slot_id", 12], ["updated_at", Tue, 10 Mar 2015 08:45:39 UTC +00:00]]

  def edit
    @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    print params
    puts "\n\n"

    valid = true
    time = nil
    time_id = nil

    # Get time
    time_valid = !(time = get_time(params)).nil?
    time_id = Homie.new.insert_into(TimeSlot, days: time[:days], start_time: time[:start], end_time: time[:end]) if time_valid

    room_id = params[:room_num].to_i
    room_id = nil if room_id == 0

    inst_id = params[:instructor_list].to_i
    inst_id = nil if inst_id == 0

    date_id = params[:date_list].to_i
    date_id = nil if date_id == 0

    # Now get section setting
    ss_id = Homie.new.insert_into(SectionSetting, time_slot_id: time_id, room_id: room_id, instructor_id: inst_id, course_date_id: date_id)


    @section = Section.find(params[:id])
    valid = @section.update(sec_params(params, ss_id))
---
INSERT INTO "time_slots" ("created_at", "days", "end_time", "start_time", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 09 Mar 2015 05:38:34 UTC +00:00], ["days", "T"], ["end_time", "6:30:00 PM"], ["start_time", "11:10:00 AM"], ["updated_at", Mon, 09 Mar 2015 05:38:34 UTC +00:00]]
INSERT INTO "section_settings" ("course_date_id", "created_at", "instructor_id", "room_id", "time_slot_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["course_date_id", 4], ["created_at", Mon, 09 Mar 2015 16:11:49 UTC +00:00], ["instructor_id", 2], ["room_id", 1], ["time_slot_id", 9], ["updated_at", Mon, 09 Mar 2015 16:11:49 UTC +00:00]]
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sections" SET "section_setting_id" = ?, "sec_capacity" = ?, "updated_at" = ? WHERE "sections"."id" = 1  [["section_setting_id", 10], ["sec_capacity", 5], ["updated_at", Mon, 09 Mar 2015 16:11:49 UTC +00:00]]